Controllers/PelangganController.php

    public function index()
    {
        $data['pelanggan'] = $this->pelangganModel->findAll();
---
SELECT *
FROM `pelanggan`