app/Controllers/KategoriController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data['kategori'] = $this->kategoriModel->findAll();

UPDATE `kategori` SET `nama_kategori` = 'Nastarr'
WHERE `kategori`.`id_kategori` IN ('1')
---
    public function update($id)
    {
        // Validasi input
        if (!$this->validate([
            'nama_kategori' => 'required|min_length[3]',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Update data
        $this->kategoriModel->update($id, [
            'nama_kategori' => $this->request->getPost('nama_kategori'),
        ]);