app/Controllers/PesananController.php

    public function index()
    {
        $pesananModel = new PesananModel();
        $pelangganModel = new PelangganModel();

        // Ambil semua pesanan dengan nama pelanggan
        $pesanan = $pesananModel->select('pesanan.*, pelanggan.nama_pelanggan')
            ->join('pelanggan', 'pelanggan.id_pelanggan = pesanan.id_pelanggan')
            ->findAll();
---
SELECT `pesanan`.*, `pelanggan`.`nama_pelanggan`
FROM `pesanan`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pesanan`.`id_pelanggan`

    public function create()
    {
        $produkModel = new ProdukModel();
        $data['produk'] = $produkModel->findAll(); // Ambil semua produk untuk ditampilkan
---
SELECT *
FROM `produk`