app/Controllers/ProdukController.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $data['produk'] = $this->produkModel->findAll();

SELECT *
FROM `kategori`
---
    public function create()
    {
        $data['kategori'] = $this->kategoriModel->findAll(); // Ambil data kategori

INSERT INTO `produk` (`nama_produk`, `kategori_produk`, `harga`, `stok`, `deskripsi`) VALUES ('nastar karamel', '1', '70000.00', '5', 'nastar dengan isian selai nanas yang dicampur dengan karamel, memberikan rasa manis yang kaya dan sedikit rasa karamel yang hangat')
---
    public function store()
    {
        // Validasi input
        if (!$this->validate([
            'nama_produk' => 'required|min_length[3]',
            'kategori_produk' => 'required',
            'harga' => 'required|decimal',
            'stok' => 'required|integer',
            'deskripsi' => 'required',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Simpan data produk
        $this->produkModel->save([
            'nama_produk' => $this->request->getPost('nama_produk'),
            'kategori_produk' => $this->request->getPost('kategori_produk'),
            'harga' => $this->request->getPost('harga'),
            'stok' => $this->request->getPost('stok'),
            'deskripsi' => $this->request->getPost('deskripsi'),
        ]);

SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        $data['produk'] = $this->produkModel->find($id); // Use the class instance
        $data['kategori'] = $this->kategoriModel->findAll(); // Use the class instance

UPDATE `produk` SET `nama_produk` = 'opera cake', `kategori_produk` = '2', `harga` = '65000.00', `stok` = '8', `deskripsi` = 'kue berlapis elegan dengan kombinasi coklat, kopi, dan krim mentega'
WHERE `produk`.`id_produk` IN ('6')
---
    public function update($id)
    {
        // Validasi input
        if (!$this->validate([
            'nama_produk' => 'required|min_length[3]',
            'kategori_produk' => 'required',
            'harga' => 'required|decimal',
            'stok' => 'required|integer',
            'deskripsi' => 'required',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Update data produk
        $this->produkModel->update($id, [
            'nama_produk' => $this->request->getPost('nama_produk'),
            'kategori_produk' => $this->request->getPost('kategori_produk'),
            'harga' => $this->request->getPost('harga'),
            'stok' => $this->request->getPost('stok'),
            'deskripsi' => $this->request->getPost('deskripsi'),
        ]);